app/Controllers/Home.php

SELECT *
FROM `tbl_faq`
SELECT *
FROM `tbl_diagnosis`
---
    public function index()
    {
        $faqModel = new FaqModel();
        $data['faq'] = $faqModel->asObject()->findAll();

        $diagnosisModel = new DiagnosisModel();
        $data['laporan'] = $diagnosisModel->findAll();