app/Controllers/MasterDiagnosisController.php

    public function cek_diagnosis()
    {
        $gejala = new GejalaModel();
        $cfUserModel = new CFUserModel();

        $data['result'] = $gejala->findAll();
        $data['listCFUser'] = $cfUserModel->findAll();
---
SELECT *
FROM `tbl_gejala`
SELECT *
FROM `tbl_cf_user`

    public function hitung()
    {
        $aturanModel = new AturanModel();
        $diagnosisModel = new DiagnosisModel();
        $gejalaModel = new GejalaModel();
        $penyakitModel = new PenyakitModel();
        $cfUserModel = new CFUserModel();
        $diagnosisGejalaModel = new DiagnosisGejalaModel();

        $namaLengkap = $this->request->getVar('nama');
        $jk = $this->request->getVar('jk');
        $pekerjaan = $this->request->getVar('pekerjaan');
        $tglDiagnosis = $this->request->getVar('tgl_diagnosis');
        $listSelectedGejala = $this->request->getVar('selectedGejala');
        $listCF = $this->request->getVar('cf');
        $p_1 = $this->request->getVar('p_1');
        $p_3_value = $this->request->getVar('p_3');
        $p_2_radio = $this->request->getVar('p_2_radio');
        $p_2 = ($p_2_radio === 'Ya') ? $this->request->getVar('p_2_detail') : 'Tidak';

        $p_3_value = $this->request->getVar('p_3');
        $p_3 = ($p_3_value === 'lainnya') ? $this->request->getVar('p_3_lainnya') : $p_3_value;

        if (count($listSelectedGejala) < 2 || empty($listCF)) {
            return redirect()->to('user/diagnosis/wellness');
        }

        // Cek jika semua CF yang dipilih memiliki nilai 0
        $allCfAreZero = true;
        foreach ($listCF as $id_gejala => $id_cf_user) {
            $cfValue = $cfUserModel->find($id_cf_user);
---
SELECT *
FROM `tbl_cf_user`
WHERE `id_cf_user` = '1'
 LIMIT 1


        for ($i = 0; $i < count($mergedDataCf); $i++) {
            $val = $mergedDataCf[$i];
            $relation = $aturanModel->where('id_gejala', $val['id_gejala'])->findAll();
---
SELECT *
FROM `tbl_gejala`
WHERE `id_gejala` = '1'
 LIMIT 1