app/Models/UserModel.php

SELECT *
FROM `tbl_user`
WHERE `email` = 'UserTest@gmail.com'
 LIMIT 1
---
    public function getUserByEmail($email)
    {
        return $this->where('email', $email)->first();